In [2]:
import pandas as pd

In [5]:
df = pd.read_excel("StockPrice.xls")
df

          Date  Close
0   2001-02-05  53.84
1   2001-02-06  53.20
2   2001-02-07  54.66
3   2001-02-08  52.30
4   2001-02-09  50.40
..         ...    ...
243 2002-01-29  57.91
244 2002-01-30  59.75
245 2002-01-31  59.98
246 2002-02-01  59.26
247 2002-02-04  58.90

[248 rows x 2 columns]